# Parameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResult..::..Parameter Property
IntersectionResult Class See Also
---
1d parameter of the point of intersection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Parameter { get; internal set; }
```

Visual Basic
---
```text
Public Property Parameter As Double
	Get
	Friend Set
```

Visual C++
---
```text
public:
property double Parameter {
	double get ();
	internal: void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

# See Also
IntersectionResult Class
Autodesk.Revit.DB Namespace